# SelectAll

## Description
Procedure SelectAll selects all visible objects on the active layer of a Vectorworks document. &lt;BR&gt;
&lt;BR&gt;
If Layer Options is set to Show-Snap-Modify Others, then SelectAll will select all visible objects within the document.&lt;BR&gt;
&lt;BR&gt;

```pascal
PROCEDURE SelectAll;
```

```python

def vs.SelectAll():
    return None
```

## Version
Availability: from MiniCAD
## Category
* Selection